In [1]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hassan-sodiq\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\hassan-sodiq\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\hassan-sodiq\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\hassan-sodiq\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\hassan-sodiq\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [35]:
df= pd.read_csv('C:/Users/Hassan-Sodiq/Downloads/StudentsPerformance.csv')

In [36]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [11]:
#Our data frame has 1000 rows and 8 columns.
df.shape

(1000, 8)

In [13]:
df.gender.value_counts

<bound method IndexOpsMixin.value_counts of 0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object>

In [37]:
df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [20]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [21]:
df.info

<bound method DataFrame.info of      gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 8 columns]>

In [54]:
df['race/ethnicity'].values

array(['group B', 'group C', 'group B', 'group A', 'group C', 'group B',
       'group B', 'group B', 'group D', 'group B', 'group C', 'group D',
       'group B', 'group A', 'group A', 'group C', 'group C', 'group B',
       'group C', 'group C', 'group D', 'group B', 'group D', 'group C',
       'group D', 'group A', 'group B', 'group C', 'group C', 'group D',
       'group D', 'group B', 'group E', 'group D', 'group E', 'group E',
       'group D', 'group D', 'group D', 'group B', 'group C', 'group C',
       'group B', 'group B', 'group E', 'group B', 'group A', 'group C',
       'group D', 'group C', 'group E', 'group E', 'group C', 'group D',
       'group C', 'group C', 'group E', 'group D', 'group D', 'group C',
       'group E', 'group A', 'group A', 'group C', 'group D', 'group B',
       'group D', 'group C', 'group B', 'group C', 'group D', 'group D',
       'group A', 'group C', 'group C', 'group B', 'group E', 'group A',
       'group D', 'group E', 'group B', 'group B', 'group A', 'group E',
       'group D', 'group C', 'group C', 'group D', 'group A', 'group D',
       'group C', 'group C', 'group C', 'group C', 'group B', 'group C',
       'group B', 'group E', 'group D', 'group D', 'group B', 'group D',
       'group D', 'group B', 'group C', 'group C', 'group D', 'group E',
       'group B', 'group B', 'group D', 'group C', 'group A', 'group D',
       'group E', 'group C', 'group B', 'group D', 'group D', 'group C',
       'group C', 'group B', 'group C', 'group D', 'group E', 'group B',
       'group B', 'group D', 'group D', 'group A', 'group D', 'group C',
       'group E', 'group C', 'group D', 'group C', 'group B', 'group E',
       'group C', 'group D', 'group D', 'group C', 'group E', 'group A',
       'group D', 'group C', 'group B', 'group C', 'group D', 'group E',
       'group A', 'group A', 'group B', 'group D', 'group D', 'group C',
       'group E', 'group B', 'group B', 'group D', 'group B', 'group E',
       'group B', 'group C', 'group E', 'group C', 'group C', 'group B',
       'group B', 'group C', 'group A', 'group E', 'group D', 'group C',
       'group C', 'group C', 'group B', 'group C', 'group B', 'group D',
       'group C', 'group C', 'group E', 'group D', 'group C', 'group C',
       'group E', 'group D', 'group B', 'group C', 'group E', 'group D',
       'group B', 'group D', 'group C', 'group D', 'group C', 'group E',
       'group B', 'group B', 'group C', 'group D', 'group C', 'group B',
       'group C', 'group D', 'group E', 'group E', 'group B', 'group B',
       'group D', 'group C', 'group C', 'group C', 'group E', 'group B',
       'group E', 'group C', 'group B', 'group B', 'group D', 'group B',
       'group C', 'group D', 'group B', 'group E', 'group C', 'group D',
       'group A', 'group C', 'group D', 'group C', 'group B', 'group E',
       'group C', 'group D', 'group D', 'group D', 'group B', 'group C',
       'group D', 'group E', 'group D', 'group E', 'group D', 'group C',
       'group E', 'group B', 'group B', 'group C', 'group A', 'group D',
       'group B', 'group D', 'group D', 'group E', 'group C', 'group C',
       'group B', 'group C', 'group C', 'group C', 'group C', 'group E',
       'group D', 'group D', 'group C', 'group D', 'group D', 'group E',
       'group C', 'group C', 'group D', 'group D', 'group B', 'group C',
       'group C', 'group E', 'group C', 'group B', 'group D', 'group D',
       'group D', 'group D', 'group B', 'group B', 'group E', 'group B',
       'group B', 'group E', 'group C', 'group D', 'group C', 'group E',
       'group D', 'group B', 'group A', 'group E', 'group C', 'group D',
       'group A', 'group D', 'group C', 'group B', 'group C', 'group A',
       'group E', 'group C', 'group B', 'group D', 'group B', 'group B',
       'group D', 'group C', 'group C', 'group C', 'group D', 'group C',
       'group B', 'group D', 'group C', 'group E', 'group C', 'group C',
       'group C', 'group C', 'group C', 'group A', 'group C', 'group B',
       'group C', 'group C', 'group E', 'group B', 'group C', 'group B',
       'group D', 'group C', 'group B', 'group D', 'group C', 'group C',
       'group B', 'group D', 'group D', 'group C', 'group B', 'group C',
       'group D', 'group E', 'group B', 'group E', 'group C', 'group C',
       'group C', 'group B', 'group A', 'group C', 'group D', 'group D',
       'group B', 'group B', 'group C', 'group D', 'group C', 'group A',
       'group C', 'group C', 'group A', 'group D', 'group E', 'group C',
       'group D', 'group D', 'group D', 'group E', 'group D', 'group D',
       'group A', 'group A', 'group B', 'group C', 'group C', 'group E',
       'group A', 'group E', 'group E', 'group C', 'group D', 'group D',
       'group E', 'group D', 'group E', 'group C', 'group C', 'group A',
       'group B', 'group C', 'group B', 'group D', 'group C', 'group A',
       'group A', 'group D', 'group C', 'group C', 'group B', 'group B',
       'group D', 'group D', 'group D', 'group E', 'group D', 'group B',
       'group C', 'group E', 'group C', 'group C', 'group D', 'group E',
       'group C', 'group D', 'group D', 'group A', 'group B', 'group C',
       'group C', 'group C', 'group A', 'group C', 'group C', 'group C',
       'group C', 'group A', 'group C', 'group C', 'group D', 'group D',
       'group C', 'group D', 'group C', 'group D', 'group A', 'group B',
       'group A', 'group C', 'group D', 'group C', 'group B', 'group B',
       'group C', 'group E', 'group C', 'group C', 'group C', 'group C',
       'group D', 'group D', 'group E', 'group B', 'group C', 'group B',
       'group E', 'group C', 'group A', 'group C', 'group D', 'group A',
       'group A', 'group C', 'group C', 'group C', 'group C', 'group D',
       'group B', 'group D', 'group E', 'group D', 'group D', 'group E',
       'group B', 'group D', 'group C', 'group A', 'group B', 'group C',
       'group D', 'group C', 'group B', 'group A', 'group A', 'group C',
       'group C', 'group C', 'group B', 'group D', 'group C', 'group D',
       'group B', 'group E', 'group D', 'group B', 'group C', 'group E',
       'group D', 'group B', 'group A', 'group B', 'group C', 'group C',
       'group D', 'group A', 'group D', 'group B', 'group B', 'group C',
       'group D', 'group E', 'group D', 'group B', 'group D', 'group C',
       'group D', 'group C', 'group C', 'group E', 'group C', 'group C',
       'group D', 'group C', 'group C', 'group C', 'group E', 'group E',
       'group B', 'group C', 'group C', 'group D', 'group E', 'group A',
       'group C', 'group D', 'group C', 'group D', 'group D', 'group E',
       'group A', 'group C', 'group C', 'group C', 'group C', 'group B',
       'group B', 'group D', 'group E', 'group C', 'group C', 'group C',
       'group B', 'group D', 'group D', 'group C', 'group C', 'group D',
       'group B', 'group B', 'group E', 'group D', 'group B', 'group D',
       'group B', 'group A', 'group C', 'group C', 'group E', 'group A',
       'group A', 'group B', 'group B', 'group D', 'group D', 'group E',
       'group D', 'group D', 'group D', 'group C', 'group A', 'group C',
       'group C', 'group A', 'group C', 'group A', 'group E', 'group E',
       'group C', 'group C', 'group B', 'group A', 'group D', 'group D',
       'group D', 'group C', 'group E', 'group D', 'group D', 'group C',
       'group C', 'group C', 'group E', 'group B', 'group D', 'group C',
       'group C', 'group C', 'group A', 'group C', 'group E', 'group D',
       'group D', 'group C', 'group C', 'group B', 'group C', 'group A',
       'group E', 'group D', 'group B', 'group D', 'group D', 'group C',
       'group D', 'group B', 'group B', 'group C', 'group D', 'group A',
       'group B', 'group D', 'group E', 'group D', 'group D', 'group D',
       'group B', 'group E', 'group B', 'group B', 'group D', 'group E',
       'group B', 'group D', 'group C', 'group A', 'group D', 'group A',
       'group B', 'group B', 'group C', 'group D', 'group D', 'group D',
       'group C', 'group C', 'group D', 'group C', 'group D', 'group C',
       'group C', 'group B', 'group C', 'group D', 'group C', 'group D',
       'group C', 'group C', 'group D', 'group B', 'group E', 'group C',
       'group D', 'group D', 'group D', 'group B', 'group B', 'group C',
       'group B', 'group E', 'group E', 'group D', 'group A', 'group E',
       'group C', 'group E', 'group C', 'group D', 'group C', 'group D',
       'group C', 'group A', 'group D', 'group C', 'group E', 'group B',
       'group A', 'group D', 'group B', 'group A', 'group D', 'group C',
       'group D', 'group D', 'group C', 'group E', 'group D', 'group D',
       'group B', 'group B', 'group C', 'group C', 'group C', 'group E',
       'group C', 'group D', 'group B', 'group C', 'group B', 'group E',
       'group E', 'group E', 'group D', 'group C', 'group B', 'group A',
       'group C', 'group D', 'group E', 'group C', 'group C', 'group B',
       'group D', 'group C', 'group D', 'group A', 'group C', 'group C',
       'group B', 'group D', 'group D', 'group C', 'group C', 'group B',
       'group D', 'group E', 'group C', 'group C', 'group C', 'group E',
       'group D', 'group E', 'group D', 'group B', 'group C', 'group D',
       'group D', 'group B', 'group D', 'group B', 'group C', 'group B',
       'group D', 'group A', 'group B', 'group D', 'group B', 'group C',
       'group B', 'group B', 'group B', 'group C', 'group A', 'group E',
       'group D', 'group B', 'group B', 'group C', 'group C', 'group B',
       'group E', 'group B', 'group C', 'group C', 'group B', 'group D',
       'group D', 'group E', 'group B', 'group E', 'group D', 'group E',
       'group E', 'group C', 'group C', 'group C', 'group E', 'group B',
       'group C', 'group A', 'group D', 'group E', 'group C', 'group B',
       'group A', 'group A', 'group C', 'group E', 'group C', 'group B',
       'group A', 'group D', 'group B', 'group C', 'group A', 'group D',
       'group E', 'group B', 'group C', 'group C', 'group C', 'group C',
       'group D', 'group B', 'group A', 'group C', 'group A', 'group B',
       'group B', 'group C', 'group E', 'group A', 'group B', 'group C',
       'group D', 'group C', 'group B', 'group B', 'group D', 'group E',
       'group C', 'group D', 'group C', 'group D', 'group C', 'group A',
       'group E', 'group E', 'group C', 'group B', 'group B', 'group C',
       'group B', 'group C', 'group C', 'group E', 'group D', 'group C',
       'group C', 'group D', 'group C', 'group B', 'group E', 'group C',
       'group B', 'group C', 'group B', 'group E', 'group C', 'group C',
       'group D', 'group C', 'group D', 'group D', 'group C', 'group E',
       'group B', 'group D', 'group E', 'group C', 'group E', 'group C',
       'group D', 'group D', 'group E', 'group E', 'group A', 'group D',
       'group E', 'group E', 'group B', 'group B', 'group D', 'group D',
       'group D', 'group C', 'group A', 'group D', 'group D', 'group D',
       'group B', 'group D', 'group C', 'group E', 'group D', 'group A',
       'group C', 'group C', 'group B', 'group E', 'group E', 'group C',
       'group C', 'group B', 'group D', 'group C', 'group D', 'group B',
       'group D', 'group E', 'group E', 'group D', 'group E', 'group C',
       'group C', 'group D', 'group D', 'group C', 'group C', 'group D',
       'group A', 'group E', 'group D', 'group D', 'group C', 'group D',
       'group C', 'group A', 'group B', 'group C', 'group B', 'group D',
       'group B', 'group E', 'group E', 'group D', 'group E', 'group C',
       'group C', 'group E', 'group C', 'group D', 'group D', 'group C',
       'group A', 'group D', 'group E', 'group C', 'group D', 'group D',
       'group A', 'group C', 'group E', 'group B', 'group D', 'group C',
       'group A', 'group D', 'group A', 'group C', 'group B', 'group C',
       'group D', 'group C', 'group B', 'group D', 'group B', 'group A',
       'group C', 'group A', 'group C', 'group E', 'group A', 'group D',
       'group E', 'group B', 'group D', 'group D', 'group A', 'group E',
       'group C', 'group C', 'group D', 'group D'], dtype=object)

In [52]:
#There are 5 different ethnic groups in the data frame, with group C appearing most and group A appearing least
df['race/ethnicity'].value_counts()

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

In [55]:
# 5 unique ethnic groups
df['race/ethnicity'].nunique()

5

In [51]:
df['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [56]:
df['race/ethnicity'].mode()

0    group C
dtype: object

In [38]:
df['race/ethnicity'].describe()

count        1000
unique          5
top       group C
freq          319
Name: race/ethnicity, dtype: object

In [79]:
#mean math score
m= math_mean= df['math score'].mean()
math_mean

66.089

In [80]:
m

66.089

66.089

In [81]:
#mean reading score
r= reading_mean= df['reading score'].mean()
reading_mean

69.169

In [82]:
#mean writing score
w=writing_mean= df['writing score'].mean()
writing_mean

68.054

In [61]:
df.gender.describe()

count       1000
unique         2
top       female
freq         518
Name: gender, dtype: object

In [63]:
#2 unique genders with more female than male
df.gender.value_counts()

female    518
male      482
Name: gender, dtype: int64

In [77]:
parental_level_of_education.value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [78]:
df.('parental_level_of_education')

SyntaxError: invalid syntax (<ipython-input-78-576bd5ef0cad>, line 1)

In [75]:
#df.parental_level_of_education was not responding, so i had to create my own series.
parental_level_of_education= df.iloc[:,2]

In [76]:
parental_level_of_education

0       bachelor's degree
1            some college
2         master's degree
3      associate's degree
4            some college
              ...
995       master's degree
996           high school
997           high school
998          some college
999          some college
Name: parental level of education, Length: 1000, dtype: object

In [90]:
df.groupby('gender')[['math score','reading score','writing score']].mean()

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [93]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [91]:
df.groupby('race/ethnicity')[['math score','reading score','writing score']].mean()

                math score  reading score  writing score
race/ethnicity
group A          61.629213      64.674157      62.674157
group B          63.452632      67.352632      65.600000
group C          64.463950      69.103448      67.827586
group D          67.362595      70.030534      70.145038
group E          73.821429      73.028571      71.407143

In [94]:
df.groupby('test preparation course')[['math score','reading score','writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

In [95]:
df.groupby('lunch')[['math score','reading score','writing score']].mean()

              math score  reading score  writing score
lunch
free/reduced   58.921127      64.653521      63.022535
standard       70.034109      71.654264      70.823256

In [98]:
df.level of education

SyntaxError: invalid syntax (<ipython-input-98-ea946ed1725f>, line 1)

In [99]:
import matplotlib.pyplot as plt

In [100]:
import numpy as np

In [103]:
df['math score'].value_counts().sort_index.plot.bar()

AttributeError: 'function' object has no attribute 'plot'